In [7]:
import pandas as pd

In [8]:
import numpy as np

In [9]:
from numpy.random import randn

In [10]:
np.random.seed(10)

In [11]:
arr=np.array(randn(5,5))

In [12]:
arr

array([[ 1.3315865 ,  0.71527897, -1.54540029, -0.00838385,  0.62133597],
       [-0.72008556,  0.26551159,  0.10854853,  0.00429143, -0.17460021],
       [ 0.43302619,  1.20303737, -0.96506567,  1.02827408,  0.22863013],
       [ 0.44513761, -1.13660221,  0.13513688,  1.484537  , -1.07980489],
       [-1.97772828, -1.7433723 ,  0.26607016,  2.38496733,  1.12369125]])

In [13]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [14]:
pd.Series(arr[0])

0    1.331587
1    0.715279
2   -1.545400
3   -0.008384
4    0.621336
dtype: float64

In [15]:
pd.Series(data=arr[0],index=[1,2,3,4,5])

1    1.331587
2    0.715279
3   -1.545400
4   -0.008384
5    0.621336
dtype: float64

In [16]:
pd.Series.argmax(arr)

TypeError: unbound method idxmax() must be called with Series instance as first argument (got ndarray instance instead)

In [ ]:
np.max(arr)

In [17]:
pd.DataFrame([1,2,3,4,5])

   0
0  1
1  2
2  3
3  4
4  5

In [18]:
df=pd.DataFrame(arr)

In [19]:
df

          0         1         2         3         4
0  1.331587  0.715279 -1.545400 -0.008384  0.621336
1 -0.720086  0.265512  0.108549  0.004291 -0.174600
2  0.433026  1.203037 -0.965066  1.028274  0.228630
3  0.445138 -1.136602  0.135137  1.484537 -1.079805
4 -1.977728 -1.743372  0.266070  2.384967  1.123691

In [20]:
df.drop(3)

          0         1         2         3         4
0  1.331587  0.715279 -1.545400 -0.008384  0.621336
1 -0.720086  0.265512  0.108549  0.004291 -0.174600
2  0.433026  1.203037 -0.965066  1.028274  0.228630
4 -1.977728 -1.743372  0.266070  2.384967  1.123691

In [21]:
df

          0         1         2         3         4
0  1.331587  0.715279 -1.545400 -0.008384  0.621336
1 -0.720086  0.265512  0.108549  0.004291 -0.174600
2  0.433026  1.203037 -0.965066  1.028274  0.228630
3  0.445138 -1.136602  0.135137  1.484537 -1.079805
4 -1.977728 -1.743372  0.266070  2.384967  1.123691

In [22]:
booldf=df>0

In [23]:
booldf

       0      1      2      3      4
0   True   True  False  False   True
1  False   True   True   True  False
2   True   True  False   True   True
3   True  False   True   True  False
4  False  False   True   True   True

In [24]:
df[booldf]

          0         1         2         3         4
0  1.331587  0.715279       NaN       NaN  0.621336
1       NaN  0.265512  0.108549  0.004291       NaN
2  0.433026  1.203037       NaN  1.028274  0.228630
3  0.445138       NaN  0.135137  1.484537       NaN
4       NaN       NaN  0.266070  2.384967  1.123691

In [25]:
df[df<0]

          0         1         2         3         4
0       NaN       NaN -1.545400 -0.008384       NaN
1 -0.720086       NaN       NaN       NaN -0.174600
2       NaN       NaN -0.965066       NaN       NaN
3       NaN -1.136602       NaN       NaN -1.079805
4 -1.977728 -1.743372       NaN       NaN       NaN

In [26]:
df

          0         1         2         3         4
0  1.331587  0.715279 -1.545400 -0.008384  0.621336
1 -0.720086  0.265512  0.108549  0.004291 -0.174600
2  0.433026  1.203037 -0.965066  1.028274  0.228630
3  0.445138 -1.136602  0.135137  1.484537 -1.079805
4 -1.977728 -1.743372  0.266070  2.384967  1.123691

In [27]:
df[(df[0]>1) | (df[1]>0)]

          0         1         2         3         4
0  1.331587  0.715279 -1.545400 -0.008384  0.621336
1 -0.720086  0.265512  0.108549  0.004291 -0.174600
2  0.433026  1.203037 -0.965066  1.028274  0.228630

In [28]:
df[df[0]>1]

          0         1       2         3         4
0  1.331587  0.715279 -1.5454 -0.008384  0.621336

In [29]:
outer=['G1','G1','G1','G2','G2','G2']
inner=['1','2','3','1','2','3']
index=list(zip(outer,inner))
index= pd.MultiIndex.from_tuples(index)

In [30]:
index

MultiIndex(levels=[[u'G1', u'G2'], [u'1', u'2', u'3']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [31]:
df=pd.DataFrame(randn(6,5),index,[1,2,3,4,5])

In [32]:
df

             1         2         3         4         5
G1 1  1.672622  0.099149  1.397996 -0.271248  0.613204
   2 -0.267317 -0.549309  0.132708 -0.476142  1.308473
   3  0.195013  0.400210 -0.337632  1.256472 -0.731970
G2 1  0.660232 -0.350872 -0.939433 -0.489337 -0.804591
   2 -0.212698 -0.339140  0.312170  0.565153 -0.147420
   3 -0.025905  0.289094 -0.539879  0.708160  0.842225

In [33]:
df.xs('1',level=1)

           1         2         3         4         5
G1  1.672622  0.099149  1.397996 -0.271248  0.613204
G2  0.660232 -0.350872 -0.939433 -0.489337 -0.804591

In [34]:
df.dropna()

             1         2         3         4         5
G1 1  1.672622  0.099149  1.397996 -0.271248  0.613204
   2 -0.267317 -0.549309  0.132708 -0.476142  1.308473
   3  0.195013  0.400210 -0.337632  1.256472 -0.731970
G2 1  0.660232 -0.350872 -0.939433 -0.489337 -0.804591
   2 -0.212698 -0.339140  0.312170  0.565153 -0.147420
   3 -0.025905  0.289094 -0.539879  0.708160  0.842225

In [35]:
df.mean(axis=1)

G1  1    0.702345
    2    0.029683
    3    0.156419
G2  1   -0.384800
    2    0.035613
    3    0.254739
dtype: float64

In [36]:
df

             1         2         3         4         5
G1 1  1.672622  0.099149  1.397996 -0.271248  0.613204
   2 -0.267317 -0.549309  0.132708 -0.476142  1.308473
   3  0.195013  0.400210 -0.337632  1.256472 -0.731970
G2 1  0.660232 -0.350872 -0.939433 -0.489337 -0.804591
   2 -0.212698 -0.339140  0.312170  0.565153 -0.147420
   3 -0.025905  0.289094 -0.539879  0.708160  0.842225

In [37]:
df.transpose()

         G1                            G2
          1         2         3         1         2         3
1  1.672622 -0.267317  0.195013  0.660232 -0.212698 -0.025905
2  0.099149 -0.549309  0.400210 -0.350872 -0.339140  0.289094
3  1.397996  0.132708 -0.337632 -0.939433  0.312170 -0.539879
4 -0.271248 -0.476142  1.256472 -0.489337  0.565153  0.708160
5  0.613204  1.308473 -0.731970 -0.804591 -0.147420  0.842225

In [38]:
df

             1         2         3         4         5
G1 1  1.672622  0.099149  1.397996 -0.271248  0.613204
   2 -0.267317 -0.549309  0.132708 -0.476142  1.308473
   3  0.195013  0.400210 -0.337632  1.256472 -0.731970
G2 1  0.660232 -0.350872 -0.939433 -0.489337 -0.804591
   2 -0.212698 -0.339140  0.312170  0.565153 -0.147420
   3 -0.025905  0.289094 -0.539879  0.708160  0.842225

In [42]:
df.isnull()

          1      2      3      4      5
G1 1  False  False  False  False  False
   2  False  False  False  False  False
   3  False  False  False  False  False
G2 1  False  False  False  False  False
   2  False  False  False  False  False
   3  False  False  False  False  False

In [43]:
pwd

u'/Users/mayankaggarwal'

In [44]:
pd.read_csv('sample.csv')

,1,"Eldon Base for stackable storage shelf, platinum",Muhammed MacIntyre,3,-213.25,38.94,35,Nunavut,Storage & Organization,0.8
0,2,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",Barry French,293,457.81,208.16,68.02,Nunavut,Appliances,0.58
1,3,"Cardinal Slant-D Ring Binder, Heavy Gauge Vinyl",Barry French,293,46.71,8.69,2.99,Nunavut,Binders and Binder Accessories,0.39
2,4,R380,Clay Rozendal,483,1198.97,195.99,3.99,Nunavut,Telephones and Communication,0.58
3,5,Holmes HEPA Air Purifier,Carlos Soltero,515,30.94,21.78,5.94,Nunavut,Appliances,0.50
4,6,G.E. Longer-Life Indoor Recessed Floodlight Bulbs,Carlos Soltero,515,4.43,6.64,4.95,Nunavut,Office Furnishings,0.37
5,7,"Angle-D Binders with Locking Rings, Label Holders",Carl Jackson,613,-54.04,7.30,7.72,Nunavut,Binders and Binder Accessories,0.38
6,8,"SAFCO Mobile Desk Side File, Wire Frame",Carl Jackson,613,127.70,42.76,6.22,Nunavut,Storage & Organization,NaN
7,9,"SAFCO Commercial Wire Shelving, Black",Monica Federle,643,-695.26,138.14,35.00,Nunavut,Storage & Organization,NaN
8,10,Xerox 198,Dorothy Badders,678,-226.36,4.98,8.33,Nunavut,Paper,0.38

In [47]:
pd.read_html('http://www.sample-videos.com/download-sample-csv.php')

[     Rows  Size(kb) Format One Click Download
 0      10         2    csv           Download
 1     100        11    csv           Download
 2    1000       119    csv           Download
 3    5000       556    csv           Download
 4   10000      1109    csv           Download
 5   50000      5300    csv           Download
 6  100000     10600    csv           Download
 7  500000     53000    csv           Download,                   0      1
 0  Total Downloaded  10569]

In [48]:
data=pd.read_html('http://www.sample-videos.com/download-sample-csv.php')

In [49]:
type(data)

list

In [50]:
data[0]

     Rows  Size(kb) Format One Click Download
0      10         2    csv           Download
1     100        11    csv           Download
2    1000       119    csv           Download
3    5000       556    csv           Download
4   10000      1109    csv           Download
5   50000      5300    csv           Download
6  100000     10600    csv           Download
7  500000     53000    csv           Download

In [51]:
data[1]

                  0      1
0  Total Downloaded  10569

In [53]:
len(data)

2

In [55]:
data[1]

                  0      1
0  Total Downloaded  10569

In [56]:
data.describe()

AttributeError: 'list' object has no attribute 'describe'

In [57]:
df.describe()

              1         2         3         4         5
count  6.000000  6.000000  6.000000  6.000000  6.000000
mean   0.336991 -0.075145  0.004322  0.215510  0.179987
std    0.735879  0.389759  0.819432  0.729477  0.872694
min   -0.267317 -0.549309 -0.939433 -0.489337 -0.804591
25%   -0.166000 -0.347939 -0.489317 -0.424919 -0.585832
50%    0.084554 -0.119996 -0.102462  0.146952  0.232892
75%    0.543927  0.241608  0.267305  0.672408  0.784970
max    1.672622  0.400210  1.397996  1.256472  1.308473